In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("data.csv", index_col=0)

In [10]:
a = df.head(10)

In [11]:
type(a)

pandas.core.frame.DataFrame

In [13]:
df.tail(2)

        Phy  Chem  Math  Eng  Bio
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [23]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     18    11    10   11   18
Mohan    17    10    13   13   11
Ravi     15    11    15   18   18
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [24]:
df.iloc[1, 1]

10

In [26]:
df.iat[1, 1]

10

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Anuj to Hari
Data columns (total 5 columns):
Phy     5 non-null int64
Chem    5 non-null int64
Math    5 non-null int64
Eng     5 non-null int64
Bio     5 non-null int64
dtypes: int64(5)
memory usage: 400.0+ bytes

In [30]:
df.describe()

             Phy       Chem       Math        Eng        Bio
count   5.000000   5.000000   5.000000   5.000000   5.000000
mean   14.800000  12.600000  13.400000  15.000000  13.800000
std     2.774887   3.646917   2.302173   2.915476   3.898718
min    12.000000  10.000000  10.000000  11.000000  10.000000
25%    12.000000  11.000000  13.000000  13.000000  11.000000
50%    15.000000  11.000000  13.000000  16.000000  12.000000
75%    17.000000  12.000000  15.000000  17.000000  18.000000
max    18.000000  19.000000  16.000000  18.000000  18.000000

In [35]:
df.dtypes

Phy     int64
Chem    int64
Math    int64
Eng     int64
Bio     int64
dtype: object

In [36]:
df.index

Index(['Anuj', 'Mohan', 'Ravi', 'Bharat', 'Hari'], dtype='object')

In [37]:
df.columns

Index(['Phy', 'Chem', 'Math', 'Eng', 'Bio'], dtype='object')

In [39]:
df2 = df.T

In [41]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     18    11    10   11   18
Mohan    17    10    13   13   11
Ravi     15    11    15   18   18
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [42]:
df.values

array([[18, 11, 10, 11, 18],
       [17, 10, 13, 13, 11],
       [15, 11, 15, 18, 18],
       [12, 19, 16, 16, 12],
       [12, 12, 13, 17, 10]])

In [43]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     18    11    10   11   18
Mohan    17    10    13   13   11
Ravi     15    11    15   18   18
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [46]:
df.sort_index(axis=1)

        Bio  Chem  Eng  Math  Phy
Anuj     18    11   11    10   18
Mohan    11    10   13    13   17
Ravi     18    11   18    15   15
Bharat   12    19   16    16   12
Hari     10    12   17    13   12

In [48]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     18    11    10   11   18
Mohan    17    10    13   13   11
Ravi     15    11    15   18   18
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [50]:
df.sort_values("Phy", axis=0)

        Phy  Chem  Math  Eng  Bio
Bharat   12    19    16   16   12
Hari     12    12    13   17   10
Ravi     15    11    15   18   18
Mohan    17    10    13   13   11
Anuj     18    11    10   11   18

In [51]:
df.sort_values("Ravi", axis=1)

        Chem  Phy  Math  Eng  Bio
Anuj      11   18    10   11   18
Mohan     10   17    13   13   11
Ravi      11   15    15   18   18
Bharat    19   12    16   16   12
Hari      12   12    13   17   10

In [53]:
df.sort_values(["Ravi", "Mohan"], axis=1)

        Chem  Math  Phy  Bio  Eng
Anuj      11    10   18   18   11
Mohan     10    13   17   11   13
Ravi      11    15   15   18   18
Bharat    19    16   12   12   16
Hari      12    13   12   10   17

In [54]:
df["Chem"]

Anuj      11
Mohan     10
Ravi      11
Bharat    19
Hari      12
Name: Chem, dtype: int64

In [55]:
df[["Chem", "Math"]]

        Chem  Math
Anuj      11    10
Mohan     10    13
Ravi      11    15
Bharat    19    16
Hari      12    13

In [58]:
df

        Phy  Chem  Math  Eng  Bio
Anuj     18    11    10   11   18
Mohan    17    10    13   13   11
Ravi     15    11    15   18   18
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [65]:
df.drop(["Phy", "Chem"], axis=0, errors="ignore")

        Phy  Chem  Math  Eng  Bio
Anuj     18    11    10   11   18
Mohan    17    10    13   13   11
Ravi     15    11    15   18   18
Bharat   12    19    16   16   12
Hari     12    12    13   17   10

In [66]:
df.drop(["Phy", "Chem"], axis=1)

        Math  Eng  Bio
Anuj      10   11   18
Mohan     13   13   11
Ravi      15   18   18
Bharat    16   16   12
Hari      13   17   10

In [70]:
df.loc[["Anuj","Bharat"], ["Phy", "Eng"]]

        Phy  Eng
Anuj     18   11
Bharat   12   16

In [76]:
df.loc[df.index > "Mohan"]

      Phy  Chem  Math  Eng  Bio
Ravi   15    11    15   18   18

In [77]:
df.index

Index(['Anuj', 'Mohan', 'Ravi', 'Bharat', 'Hari'], dtype='object')

In [78]:
df.index > "Mohan"

array([False, False,  True, False, False])

In [83]:
df.loc[(df["Chem"] > 12) & (df["Eng"] > 12)]

        Phy  Chem  Math  Eng  Bio
Bharat   12    19    16   16   12

In [87]:
df.groupby(["Chem"]).median()

       Phy  Math   Eng   Bio
Chem
10    17.0  13.0  13.0  11.0
11    16.5  12.5  14.5  18.0
12    12.0  13.0  17.0  10.0
19    12.0  16.0  16.0  12.0

In [88]:
import numpy as np

In [91]:
df.iloc[:1, 3:] = np.NaN

In [92]:
df.isna()

          Phy   Chem   Math    Eng    Bio
Anuj    False  False  False   True   True
Mohan   False  False  False  False  False
Ravi    False  False  False  False  False
Bharat  False  False  False  False  False
Hari    False  False  False  False  False

In [104]:
df.dropna(axis=0, thresh=3)

        Phy  Chem  Math   Eng   Bio
Anuj     18    11    10   NaN   NaN
Mohan    17    10    13  13.0  11.0
Ravi     15    11    15  18.0  18.0
Bharat   12    19    16  16.0  12.0
Hari     12    12    13  17.0  10.0